Revit 2024 API
LinkedResourceOpenedEventArgs Class
 The event arguments used by [!:Autodesk::Revit::ApplicationServices::Application::LinkedResourceOpened].
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class LinkedResourceOpenedEventArgs : RevitAPIPostDocEventArgs
Visual Basic
Public Class LinkedResourceOpenedEventArgs _
	Inherits RevitAPIPostDocEventArgs
Visual C++
public ref class LinkedResourceOpenedEventArgs : public RevitAPIPostDocEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPostDocEventArgs
 Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs
See Also
LinkedResourceOpenedEventArgs Members
Autodesk.Revit.DB.Events Namespace